package main

import "fmt"

// Представьте, что вам нужно написать программу, которая перебирает числа и заменяет некоторые из них специальными словами по определённым правилам.

// Это классическая задача FizzBuzz, которая помогает потренироваться в использовании циклов, условных операторов и логических выражений.

// Что необходимо сделать
// Напишите программу, которая перебирает все целые числа от 1 до 30 включительно.

// Для каждого числа определите, что нужно вывести:

// FizzBuzz — если число делится одновременно на 3 и на 5 без остатка.
// Fizz — если число делится на 3, но не на 5.
// Buzz — если число делится на 5, но не на 3.
// Само число — если ни одно из перечисленных условий не выполняется.
// Каждый результат должен выводиться с новой строки.
func main() {
	for i := 1; i <= 30; i++ {
		switch {
		case i%3 == 0 && i%5 == 0:
			fmt.Println("FizzBuzz")

		case i%3 == 0 && i%5 != 0:
			fmt.Println("Fizz")

		case i%3 != 0 && i%5 == 0:
			fmt.Println("Buzz")

		default:
			fmt.Println(i)
		}
	}
}
