package main

import "fmt"

// Представьте, что вы разрабатываете небольшой интернет-магазин. В течение дня покупатели оформляют заказы на разные суммы.

// В конце дня владельцу магазина необходимо получить простую статистику: какой заказ был самым дешёвым, какой - самым дорогим, сколько денег принесли все заказы и какова средняя стоимость одного заказа.

// Данные о заказах хранятся в виде среза целых чисел. Все суммы указаны в копейках, чтобы не использовать дробные числа для хранения денежных значений.

// Что необходимо сделать
// Дан срез сумм заказов:

// orders := []int{12000, 7500, 31000, 4500}

// Напишите программу, которая вычисляет:

// Минимальную сумму заказа — наименьшее значение в срезе.
// Максимальную сумму заказа — наибольшее значение в срезе.
// Общую сумму заказов — сумму всех элементов среза.
// Среднюю сумму заказа — общую сумму, разделённую на количество заказов.
// Для минимального, максимального и общего значения используйте тип int.

// Среднюю сумму вычислите и сохраните в переменной типа float64.

// Ожидаемый результат
// Количество заказов: 4
// Минимальный заказ: 4500 коп.
// Максимальный заказ: 31000 коп.
// Общая сумма: 55000 коп.
// Средний заказ: 13750 коп.

func main() {
	orders := []int64{12000, 7501, 31000, 4500}

	var countOfOrders uint64 = 0
	var minValuableOrder int64 = 1000000
	var maxValuableOrdre int64 = 0
	var totalAmount int64 = 0
	var avarageAmount float64 = 0

	for _, v := range orders {
		countOfOrders++
		totalAmount += v
		if v < minValuableOrder {
			minValuableOrder = v
		}
		if v > maxValuableOrdre {
			maxValuableOrdre = v
		}
	}
	avarageAmount = float64(totalAmount) / float64(countOfOrders)

	if countOfOrders != 0 {
		fmt.Println("Количество заказов: ", countOfOrders)
		fmt.Println("Минимальный заказ: ", minValuableOrder, " коп.")
		fmt.Println("Максимальный заказ: ", maxValuableOrdre, " коп.")
		fmt.Println("Общая сумма: ", totalAmount, " коп.")
		fmt.Println("Средний заказ: ", avarageAmount, " коп.")
	} else {
		fmt.Println("Нет заказов для анализа")
	}

}
